DatanoiseTV/jtag-idf-component/example/sdkconfig.defaults
# Target ESP32-S3 (has WiFi + sufficient GPIO)
# For ESP32-P4: use Ethernet or esp_wifi_remote with C6 coprocessor
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
# Allow large firmware uploads
CONFIG_ESP_HTTP_SERVER_ENABLE=y
# Use PSRAM for large firmware buffer if available
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
